<a href="https://colab.research.google.com/github/venkat2ram/Python/blob/master/asgn5_linear.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Linear regression

Import required packages and explain them.

In [0]:
import pandas as pd #Pandas is used for loading data into data frame, data analysis and wrangling.
import seaborn as sns #Seaborn library is used for drawing plots and data analysis.
from matplotlib import pyplot as plt #matplotlib is used for drawing varous plots.
import numpy as np #numpy package helps us to do mathematical calculations on datasets.

Read file into dataframe.

In [0]:
df=pd.read_csv('/content/insurance.csv')

In [5]:
df

      X      Y
0   108  392.5
1    19   46.2
2    13   15.7
3   124  422.2
4    40  119.4
..  ...    ...
58    9   87.4
59   31  209.8
60   14   95.5
61   53  244.6
62   26  187.5

[63 rows x 2 columns]

Print first 5 records.

In [8]:
df.head()

     X      Y
0  108  392.5
1   19   46.2
2   13   15.7
3  124  422.2
4   40  119.4

Print last 5 records.

In [9]:
df.tail()

     X      Y
58   9   87.4
59  31  209.8
60  14   95.5
61  53  244.6
62  26  187.5

Print total shape of dataframe.

In [11]:
df.shape

(63, 2)

Extract the values from dataframe.

In [0]:
X=df['X']
y=df['Y']

Calculate mean of X and y. as well as number of rows.

In [0]:
mean_x=X.mean()
mean_y=y.mean()
n=len(X)

find slope and intercept.

In [0]:
numer=0
denom=0
for i in range(n):
  numer=numer+(X[i]-mean_x)*(y[i]-mean_y)
  denom=denom+(X[i]-mean_x)**2
slope=numer/denom
intercept=mean_y-